Revit 2024 API
TextAlignMask Enumeration
An enumerated type listing all the Text align mask.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum TextAlignMask
Visual Basic
Public Enumeration TextAlignMask
Visual C++
public enum class TextAlignMask
Members
Member name | Description
horzAlignMask | The mask of the Text object being aligned in the horizontal direction.
vertAlignMask | The mask of the Text object being aligned in the vertical direction.
See Also
Autodesk.Revit.DB Namespace